iandmorris/zephyr/include/zephyr/dt-bindings/pinctrl/renesas/pinctrl-r7fa2e1xxxxxx.h
#define P411_GTOVUP       RA_PINCFG__64(4, 11, 0x03, RA_PINCFG_FUNC)
#define P411_MOSI0        RA_PINCFG__64(4, 11, 0x04, RA_PINCFG_FUNC)
#define P411_MOSIA        RA_PINCFG__64(4, 11, 0x06, RA_PINCFG_FUNC)
#define P411_SDA0         RA_PINCFG__64(4, 11, 0x04, RA_PINCFG_FUNC)
#define P411_SEG07        RA_PINCFG__64(4, 11, 0x0D, RA_PINCFG_FUNC)
#define P411_TS07         RA_PINCFG__64(4, 11, 0x0C, RA_PINCFG_FUNC)
#define P411_TXD0         RA_PINCFG__64(4, 11, 0x04, RA_PINCFG_FUNC)
#define P412_RSPCKA       RA_PINCFG_100(4, 12, 0x06, RA_PINCFG_FUNC)
#define P412_SCK0         RA_PINCFG_100(4, 12, 0x04, RA_PINCFG_FUNC)
#define P413_CTS0_RTS0    RA_PINCFG_100(4, 13, 0x04, RA_PINCFG_FUNC)
#define P413_SS0          RA_PINCFG_100(4, 13, 0x04, RA_PINCFG_FUNC)
#define P413_SSLA0        RA_PINCFG_100(4, 13, 0x06, RA_PINCFG_FUNC)
#define P414_GTIOC0B      RA_PINCFG_100(4, 14, 0x04, RA_PINCFG_FUNC)
#define P414_SSLA1        RA_PINCFG_100(4, 14, 0x06, RA_PINCFG_FUNC)
#define P415_GTIOC0A      RA_PINCFG_100(4, 15, 0x04, RA_PINCFG_FUNC)
#define P415_SSLA2        RA_PINCFG_100(4, 15, 0x06, RA_PINCFG_FUNC)
#define P500_AGTOA0       RA_PINCFG__48(5, 0, 0x01, RA_PINCFG_FUNC)
#define P500_AN016        RA_PINCFG__48(5, 0, 0x01, RA_PINCFG_ANALOG)
#define P500_CMPREF1      RA_PINCFG__48(5, 0, 0x02, RA_PINCFG_FUNC | RA_PINCFG_ANALOG)
#define P500_GTIOC2A      RA_PINCFG__48(5, 0, 0x04, RA_PINCFG_FUNC)
#define P500_GTIU         RA_PINCFG__48(5, 0, 0x03, RA_PINCFG_FUNC)
#define P500_SEG34        RA_PINCFG__48(5, 0, 0x0D, RA_PINCFG_FUNC)
#define P500_USB_VBUSEN   RA_PINCFG__48(5, 0, 0x13, RA_PINCFG_FUNC)
#define P501_AGTOB0       RA_PINCFG__64(5, 1, 0x01, RA_PINCFG_FUNC)
#define P501_AN017        RA_PINCFG__64(5, 1, 0x01, RA_PINCFG_ANALOG)
#define P501_CMPIN1       RA_PINCFG__64(5, 1, 0x02, RA_PINCFG_FUNC | RA_PINCFG_ANALOG)
#define P501_GTIOC2B      RA_PINCFG__64(5, 1, 0x04, RA_PINCFG_FUNC)
#define P501_GTIV         RA_PINCFG__64(5, 1, 0x03, RA_PINCFG_FUNC)
#define P501_MOSI1        RA_PINCFG__64(5, 1, 0x05, RA_PINCFG_FUNC)
#define P501_SDA1         RA_PINCFG__64(5, 1, 0x05, RA_PINCFG_FUNC)
#define P501_SEG35        RA_PINCFG__64(5, 1, 0x0D, RA_PINCFG_FUNC)
#define P501_TXD1         RA_PINCFG__64(5, 1, 0x05, RA_PINCFG_FUNC)
#define P501_USB_OVRCUR_A RA_PINCFG__64(5, 1, 0x13, RA_PINCFG_FUNC)
#define P502_AN018        RA_PINCFG__64(5, 2, 0x01, RA_PINCFG_ANALOG)
#define P502_CMPREF0      RA_PINCFG__64(5, 2, 0x02, RA_PINCFG_FUNC | RA_PINCFG_ANALOG)
#define P502_GTIOC3B      RA_PINCFG__64(5, 2, 0x04, RA_PINCFG_FUNC)
#define P502_GTIW         RA_PINCFG__64(5, 2, 0x03, RA_PINCFG_FUNC)
#define P502_MISO1        RA_PINCFG__64(5, 2, 0x05, RA_PINCFG_FUNC)
#define P502_RXD1         RA_PINCFG__64(5, 2, 0x05, RA_PINCFG_FUNC)
#define P502_SCL1         RA_PINCFG__64(5, 2, 0x05, RA_PINCFG_FUNC)
#define P502_SEG36        RA_PINCFG__64(5, 2, 0x0D, RA_PINCFG_FUNC)
#define P502_USB_OVRCUR_B RA_PINCFG__64(5, 2, 0x13, RA_PINCFG_FUNC)
#define P503_AN023        RA_PINCFG_100(5, 3, 0x01, RA_PINCFG_ANALOG)
#define P503_CMPIN0       RA_PINCFG_100(5, 3, 0x02, RA_PINCFG_FUNC | RA_PINCFG_ANALOG)
#define P503_SCK1         RA_PINCFG_100(5, 3, 0x05, RA_PINCFG_FUNC)
#define P503_SEG37        RA_PINCFG_100(5, 3, 0x0D, RA_PINCFG_FUNC)
#define P503_USB_EXICEN   RA_PINCFG_100(5, 3, 0x13, RA_PINCFG_FUNC)
#define P504_AN024        RA_PINCFG_100(5, 4, 0x01, RA_PINCFG_ANALOG)
#define P504_CTS1_RTS1    RA_PINCFG_100(5, 4, 0x05, RA_PINCFG_FUNC)
#define P504_SS1          RA_PINCFG_100(5, 4, 0x05, RA_PINCFG_FUNC)
#define P504_USB_ID       RA_PINCFG_100(5, 4, 0x13, RA_PINCFG_FUNC)
#define P505_AN025        RA_PINCFG_100(5, 5, 0x01, RA_PINCFG_ANALOG)
#define P600_GTIOC6B      RA_PINCFG_100(6, 0, 0x01, RA_PINCFG_FUNC)
#define P600_SCK9         RA_PINCFG_100(6, 0, 0x05, RA_PINCFG_FUNC)
#define P600_SEG33        RA_PINCFG_100(6, 0, 0x0D, RA_PINCFG_FUNC)
#define P601_GTIOC6A      RA_PINCFG_100(6, 1, 0x01, RA_PINCFG_FUNC)
#define P601_MISO9        RA_PINCFG_100(6, 1, 0x05, RA_PINCFG_FUNC)
#define P601_RXD9         RA_PINCFG_100(6, 1, 0x05, RA_PINCFG_FUNC)
#define P601_SCL9         RA_PINCFG_100(6, 1, 0x05, RA_PINCFG_FUNC)
#define P601_SEG32        RA_PINCFG_100(6, 1, 0x0D, RA_PINCFG_FUNC)
#define P602_GTIOC7B      RA_PINCFG_100(6, 2, 0x01, RA_PINCFG_FUNC)
#define P602_MOSI9        RA_PINCFG_100(6, 2, 0x05, RA_PINCFG_FUNC)
#define P602_SDA9         RA_PINCFG_100(6, 2, 0x05, RA_PINCFG_FUNC)
#define P602_SEG31        RA_PINCFG_100(6, 2, 0x0D, RA_PINCFG_FUNC)
#define P602_TXD9         RA_PINCFG_100(6, 2, 0x05, RA_PINCFG_FUNC)
#define P603_CTS9_RTS9    RA_PINCFG_100(6, 3, 0x05, RA_PINCFG_FUNC)
#define P603_GTIOC7A      RA_PINCFG_100(6, 3, 0x01, RA_PINCFG_FUNC)
#define P603_SEG30        RA_PINCFG_100(6, 3, 0x0D, RA_PINCFG_FUNC)
#define P603_SS9          RA_PINCFG_100(6, 3, 0x05, RA_PINCFG_FUNC)
#define P608_GTIOC4B      RA_PINCFG_100(6, 8, 0x01, RA_PINCFG_FUNC)
#define P608_SEG27        RA_PINCFG_100(6, 8, 0x0D, RA_PINCFG_FUNC)
#define P609_GTIOC5A      RA_PINCFG_100(6, 9, 0x01, RA_PINCFG_FUNC)
#define P609_SEG28        RA_PINCFG_100(6, 9, 0x0D, RA_PINCFG_FUNC)
#define P610_GTIOC5B      RA_PINCFG_100(6, 10, 0x01, RA_PINCFG_FUNC)
#define P610_SEG29        RA_PINCFG_100(6, 10, 0x0D, RA_PINCFG_FUNC)
#define P708_MISO1        RA_PINCFG_100(7, 8, 0x05, RA_PINCFG_FUNC)
#define P708_RXD1         RA_PINCFG_100(7, 8, 0x05, RA_PINCFG_FUNC)
#define P708_SCL1         RA_PINCFG_100(7, 8, 0x05, RA_PINCFG_FUNC)
#define P708_SSLA3        RA_PINCFG_100(7, 8, 0x06, RA_PINCFG_FUNC)
#define P808_SEG21        RA_PINCFG_100(8, 8, 0x0D, RA_PINCFG_FUNC)
#define P809_SEG22        RA_PINCFG_100(8, 9, 0x0D, RA_PINCFG_FUNC)
#define P914_USB_DP       RA_PINCFG__40(9, 14, 0x00, RA_PINCFG_GPIO)
#define P915_USB_DM       RA_PINCFG__40(9, 15, 0x00, RA_PINCFG_GPIO)
#endif
